{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "# 从Neo4j构建一个igraph实例\n",
    "\n",
    "graph = Graph(host=\"192.168.1.166://7474\", auth=(\"neo4j\", \"pw123456\"))\n",
    "    \n",
    "query = '''\n",
    "MATCH (c1:Character)-[r:INTERACTS]->(c2:Character)\n",
    "RETURN c1.name, c2.name, r.weight AS weight\n",
    "'''\n",
    "ig = IGraph.TupleList(graph.run(query), weights=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 0, {'name': 'Stannis'}), 0.01802013176519559)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 1, {'name': 'Aemon'}), 0.00732898099194757)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 2, {'name': 'Jon'}), 0.03582869669163556)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 3, {'name': 'Robert'}), 0.022292016521362864)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 4, {'name': 'Janos'}), 0.00922724179702541)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 5, {'name': 'Alliser'}), 0.005162125869510502)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 6, {'name': 'Eddard'}), 0.013969322258977051)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 7, {'name': 'Arya'}), 0.02205020966384447)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 8, {'name': 'Robb'}), 0.03017114665594764)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 9, {'name': 'Sansa'}), 0.030009716660108567)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 10, {'name': 'Tyrion'}), 0.042884981999963316)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 11, {'name': 'Balon'}), 0.0075868971436667204)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 12, {'name': 'Jaime'}), 0.02872758758747121)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 13, {'name': 'Tywin'}), 0.025700162626425414)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 14, {'name': 'Daenerys'}), 0.02881425425830274)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 15, {'name': 'Belwas'}), 0.009060243767082135)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 16, {'name': 'Jorah'}), 0.011545271681757233)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 17, {'name': 'Sandor'}), 0.014890666079839642)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 18, {'name': 'Beric'}), 0.008222353952587195)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 19, {'name': 'Bran'}), 0.018868841806170253)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 20, {'name': 'Catelyn'}), 0.02118215995142649)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 21, {'name': 'Cersei'}), 0.0222873275897735)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 22, {'name': 'Brienne'}), 0.008575195335424802)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 23, {'name': 'Roose'}), 0.005455687276974581)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 24, {'name': 'Bronn'}), 0.005471445930153537)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 25, {'name': 'Brynden'}), 0.010232443796594935)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 26, {'name': 'Rickard'}), 0.0035148852985689327)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 27, {'name': 'Edmure'}), 0.010290932718974887)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 28, {'name': 'Lysa'}), 0.012945163039228616)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 29, {'name': 'Gilly'}), 0.0066052326224818134)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 30, {'name': 'Craster'}), 0.00897165610902576)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 31, {'name': 'Samwell'}), 0.021619725923803453)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 32, {'name': 'Mance'}), 0.018095171947238788)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 33, {'name': 'Daario'}), 0.00847965219656795)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 34, {'name': 'Davos'}), 0.013406264700364072)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 35, {'name': 'Melisandre'}), 0.0071714541653477345)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 36, {'name': 'Shireen'}), 0.003680934157940396)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 37, {'name': 'Eddison'}), 0.005182223005393166)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 38, {'name': 'Hoster'}), 0.004595888282976935)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 39, {'name': 'Gendry'}), 0.0056804956957993615)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 40, {'name': 'Joffrey'}), 0.020353375452309388)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 41, {'name': 'Gregor'}), 0.01393384733499796)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 42, {'name': 'Hodor'}), 0.0062280726829178285)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 43, {'name': 'Irri'}), 0.00889807023680225)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 44, {'name': 'Missandei'}), 0.005042145949881647)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 45, {'name': 'Walton'}), 0.002419304552601443)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 46, {'name': 'Aerys'}), 0.005477506014302079)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 47, {'name': 'Jojen'}), 0.006392442840482076)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 48, {'name': 'Rhaegar'}), 0.010020348713084552)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 49, {'name': 'Kevan'}), 0.008673400294127468)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 50, {'name': 'Loras'}), 0.011034754649094813)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 51, {'name': 'Renly'}), 0.009743338318262837)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 52, {'name': 'Walder'}), 0.010033606402732681)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 53, {'name': 'Lothar'}), 0.006892711038826189)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 54, {'name': 'Luwin'}), 0.0044303954980799715)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 55, {'name': 'Jon Arryn'}), 0.003554886575166184)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 56, {'name': 'Meera'}), 0.007625777538924644)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 57, {'name': 'Meryn'}), 0.008334326126099073)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 58, {'name': 'Myrcella'}), 0.005477112953196366)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 59, {'name': 'Oberyn'}), 0.010531487628639504)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 60, {'name': 'Amory'}), 0.0026806926566418743)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 61, {'name': 'Podrick'}), 0.006604837769499045)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 62, {'name': 'Ygritte'}), 0.006597052731030596)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 63, {'name': 'Rattleshirt'}), 0.006597052731030596)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 64, {'name': 'Viserys'}), 0.005583417500580618)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 65, {'name': 'Rickon'}), 0.007772551455592107)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 66, {'name': 'Robert Arryn'}), 0.004860411499568623)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 67, {'name': 'Shae'}), 0.006959463009032679)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 68, {'name': 'Tommen'}), 0.006590960058389481)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 69, {'name': 'Val'}), 0.006320682995486324)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 70, {'name': 'Varys'}), 0.008958179876287903)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 71, {'name': 'Grenn'}), 0.006512533024510499)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 72, {'name': 'Anguy'}), 0.0035531593836143844)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 73, {'name': 'Thoros'}), 0.006786563751376052)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 74, {'name': 'Barristan'}), 0.01020185133267823)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 75, {'name': 'Illyrio'}), 0.0033271709593834554)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 76, {'name': 'Nan'}), 0.0044303954980799715)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 77, {'name': 'Theon'}), 0.005845730630364401)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 78, {'name': 'Jeyne'}), 0.0034279568095536435)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 79, {'name': 'Petyr'}), 0.008580976142737052)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 80, {'name': 'Roslin'}), 0.0057333809815333005)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 81, {'name': 'Elia'}), 0.006785608304081953)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 82, {'name': 'Ilyn'}), 0.00729540091768306)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 83, {'name': 'Pycelle'}), 0.005442382470169084)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 84, {'name': 'Karl'}), 0.0029270506974128844)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 85, {'name': 'Drogo'}), 0.008479652196567947)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 86, {'name': 'Aegon'}), 0.003151306024561171)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 87, {'name': 'Kraznys'}), 0.0031513060245611717)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 88, {'name': 'Rakharo'}), 0.0031513060245611704)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 89, {'name': 'Worm'}), 0.0031513060245611717)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 90, {'name': 'Cressen'}), 0.003680934157940397)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 91, {'name': 'Salladhor'}), 0.003680934157940398)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 92, {'name': 'Qyburn'}), 0.0024193045526014426)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 93, {'name': 'Bowen'}), 0.003934179549139299)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 94, {'name': 'Margaery'}), 0.008677336342741149)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 95, {'name': 'Dalla'}), 0.0051980784181394155)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 96, {'name': 'Orell'}), 0.002573191935335821)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 97, {'name': 'Qhorin'}), 0.007883798494635434)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 98, {'name': 'Styr'}), 0.00385493328159857)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 99, {'name': 'Lancel'}), 0.002630600867213229)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 100, {'name': 'Olenna'}), 0.0034251273221042565)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 101, {'name': 'Marillion'}), 0.004860411499568623)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 102, {'name': 'Ellaria'}), 0.003693254731641008)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 103, {'name': 'Mace'}), 0.004686215560389263)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 104, {'name': 'Ramsay'}), 0.002427688145180724)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 105, {'name': 'Chataya'}), 0.003597539945413196)\n",
      "(igraph.Vertex(<igraph.Graph object at 0x000002000216FE58>, 106, {'name': 'Doran'}), 0.002414431233877638)\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x20004a2cd30>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# PageRank\n",
    "pg = ig.pagerank()\n",
    "pgvs = []\n",
    "for p in zip(ig.vs, pg):\n",
    "    print(p)\n",
    "    pgvs.append({\"name\": p[0][\"name\"], \"pg\": p[1]})\n",
    "pgvs\n",
    "\n",
    "write_clusters_query = '''\n",
    "UNWIND {nodes} AS n\n",
    "MATCH (c:Character) WHERE c.name = n.name\n",
    "SET c.pagerank = n.pg\n",
    "'''\n",
    "\n",
    "graph.run(write_clusters_query, nodes=pgvs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
